Revit 2026 API

# ExportPatternKey(ExportPatternKey) Constructor

---

Constructs a new copy of the input ExportPatternKey object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ExportPatternKey(
	ExportPatternKey other
)
```
```vb
Public Sub New (
	other As ExportPatternKey
)
```
```cpp
public:
ExportPatternKey(
	ExportPatternKey^ other
)
```
```fsharp
new :
        other : ExportPatternKey -> ExportPatternKey
```

#### Parameters

other ExportPatternKey

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExportPatternKey Class

ExportPatternKey Overload

Autodesk.Revit.DB Namespace